In [54]:
import pandas as pd

In [55]:
#Series
values = [10,20,30,40,50]
s = pd.Series(values, index=['a','b','c', 'd','a'])
#Data Frame

s.loc['a']

df = pd.DataFrame({
    'name': ['Bob','Alice','Jack'],
    'age' : [25, 18, 27],
    'job' : ['Programmer', 'Clerk', 'Designer']
})

df = df.set_index('name')

In [56]:
df1 = pd.DataFrame({
    'a':[1,2,3]
},  index= [0,1,2])

df2 = pd.DataFrame({
    'a':[10,20,30]
}, index=[1,2,0])

In [57]:
df1 * df2
df = df.reset_index()
df.to_csv('df.csv')
pd.read_csv('df.csv', index_col=0)

    name  age         job
0    Bob   25  Programmer
1  Alice   18       Clerk
2   Jack   27    Designer